[
  {
    "id": "6",
    "name": {
      "en": "WorkStream / 2024.07 - NOW",
      "cn": "WorkStream / 2024.07 - NOW"
    },
    "describe": {
      "en":
        "As a remote Senior Backend Developer at a leading California-based HR and Payroll platform for the hourly workforce, I joined the Time Shift team to drive new feature development. Collaborating closely with the product manager, I spearhead initiatives to enhance functionality and user experience, focusing on scalable, high-performance solutions.",
      "cn":
        "在 WorkStream 担任高级开发人员, 我加入了 Time Shift 团队, 与产品经理紧密合作，推动新功能的开发, 专注于提供可扩展的高性能解决方案, 以提升功能性和用户体验。"
    }
  },
  {
    "id": "5",
    "name": {
      "en": "Datature / 2022.08 - 2024.06",
      "cn": "Datature / 2022.08 - 2024.06"
    },
    "describe": {
      "en":
        "As a Backend Developer at a Singapore-based AI Vision startup, I led the development of public APIs and SDKs. This initiative enabled clients to seamlessly upload and annotate assets, as well as train and deploy models, effectively putting powerful machine learning capabilities at their fingertips.",
      "cn":
        "在新加坡一家人工智能视觉创业公司担任后端开发人员，领导开发了 Public API 和 SDK 。与社区紧密合作，了解分析研发用户需求，使用用户可以通过集成 SDK 完成上传资产，标注资产，训练并部署模型至云端的能力。"
    }
  },
  {
    "id": "4",
    "name": {
      "en": "StoreHub / 2019.03 - 2022.08",
      "cn": "StoreHub / 2019.03 - 2022.08"
    },
    "describe": {
      "en":
        "As a Backend Developer at a pioneering new retail startup in Malaysia, which successfully secured USD 8.9M in Series A funding led by Vertex Ventures, I played a key role in the company’s financial infrastructure. I developed payment products and integrated various third-party payment systems in Southeast Asia for our POS and online platforms. I also helped move our company to a microservices setup using Kubernetes and adopted Domain-Driven Design principles.",
      "cn":
        "作为马来西亚一家新零售创业公司的后台开发人员，我在公司的金融基础设施方面发挥了关键作用。该公司成功获得了由 Vertex Ventures 领投的 890 万美元 A 轮融资。我开发了支付服务，并为我们的 POS 和 Web 平台整合了东南亚的各种第三方支付系统。我还使用 Kubernetes 和领域驱动设计原则，帮助公司转向微服务架构。"
    }
  }
]
