[
  {
    "id": "5",
    "name": {
      "en": "Datature / 2022.08 - NOW",
      "cn": "Datature / 2022.08 - 至今"
    },
    "describe": {
      "en":
        "Worked as Backend Developer at a Singapore-based AI Vision startup, where I led the development of public APIs and SDKs, empowering clients with the ability to upload assets, annotate assets, train models, and deploy models.",
      "cn":
        "在新加坡一家人工智能视觉初创公司担任后端开发员，领导Public API和 SDK 的开发工作，为客户提供上传资产、注释资产、训练模型和部署模型的能力."
    }
  },
  {
    "id": "4",
    "name": {
      "en": "StoreHub / 2019.03 - 2022.08",
      "cn": "StoreHub / 2019.03 - 2022.08"
    },
    "describe": {
      "en":
        "Malaysian new retail startup, Series A led by Vertex Ventures financed USD 8.9M. Worked as Backend Developer, responsible for payment products, integrate Southeast Asia third-party payments to provide payment capabilities for the company's POS and Web. Participated in the transformation of microservices, K8s, and DDD. Main technology stack: TypeScript, MongoDB, Elasticsearch, RedShift.",
      "cn":
        "马来西亚新零售初创公司，A轮 Vertex Ventures 领投 US$ 8.9M，担任后端开发工程师一职，负责支付产品，对接东南亚第三方支付，给公司产品提供支付能力。参与了微服务、K8s的改造，主要技术栈：TypeScript、MongoDB、RedShift、AWS"
    }
  },
  {
    "id": "3",
    "name": {
      "en": "JiangSu ZhaoMi Technology / 2017.08 - 2019.03",
      "cn": "江苏兆米技术有限公司 / 2017.08 - 2019.03"
    },
    "describe": {
      "en":
        "Worked in a shared bookstore technology service provider as a full-stack developer. Daily write RESTful APIs and have a deeper understanding of Node.js during this work, familiar with ES6 features and apply them to production, and have some thoughts about architecture and software design patterns, want to write elegant and easy to expanded code. Main technology stack: JavaScript, Mysql, sqs.",
      "cn":
        "某省共享书店的技术服务商担任全栈工程师一职，编写 RESTful API，日常开发 API 的过程对 Node.js 有了更深的理解，熟悉 ES6 特性并应用于生产，日常的工作中对架构和软件的设计模式有了一些思考，对代码不再满足于能用，而是坚持写出能读懂的，优雅的，易拓展的代码。主要技术栈：JavaScript, Mysql, Nsq."
    }
  }
]
