[
  {
    "id": "5",
    "name": {
      "en": "Datature / 2022.08 - Present",
      "cn": "Datature / 2022.08 - 至今"
    },
    "describe": {
      "en":
        "As a Backend Developer at a Singapore-based AI Vision startup, I led the development of public APIs and SDKs. This initiative enabled clients to seamlessly upload and annotate assets, as well as train and deploy models, effectively putting powerful machine learning capabilities at their fingertips.",
      "cn":
        "作为新加坡一家人工智能视觉初创公司的后端开发人员，我领导了公共应用程序接口和 SDK 的开发工作。这一举措使客户能够无缝上传和注释资产，以及训练和部署模型，从而有效地将强大的机器学习功能置于客户的指尖。"
    }
  },
  {
    "id": "4",
    "name": {
      "en": "StoreHub / 2019.03 - 2022.08",
      "cn": "StoreHub / 2019.03 - 2022.08"
    },
    "describe": {
      "en":
        "As a Backend Developer at a pioneering new retail startup in Malaysia, which successfully secured USD 8.9M in Series A funding led by Vertex Ventures, I played a key role in the company’s financial infrastructure. I developed payment products and integrated various third-party payment systems in Southeast Asia for our POS and online platforms. I also helped move our company to a microservices setup using Kubernetes and adopted Domain-Driven Design principles.",
      "cn":
        "作为马来西亚一家新零售创业公司的后台开发人员，我在公司的金融基础设施方面发挥了关键作用。该公司成功获得了由 Vertex Ventures 领投的 890 万美元 A 轮融资。我开发了支付产品，并为我们的 POS 和在线平台整合了东南亚的各种第三方支付系统。我还使用 Kubernetes 和领域驱动设计原则，帮助公司转向微服务架构。"
    }
  },
  {
    "id": "3",
    "name": {
      "en": "JiangSu ZhaoMi Technology / 2017.08 - 2019.03",
      "cn": "江苏兆米技术有限公司 / 2017.08 - 2019.03"
    },
    "describe": {
      "en":
        "As a Full-Stack Developer at a collaborative bookstore technology service provider, I engaged in daily development of RESTful APIs and deepened my expertise in Node.js. I am well-versed in ES6 features, which I actively incorporate into production. I am passionate about architecture and software design patterns, I am committed to crafting elegant and scalable code.",
      "cn":
        "作为一家合作书店技术服务提供商的全栈开发人员，我参与了 RESTful API 的日常开发工作，并加深了我在 Node.js 方面的专业知识。我精通 ES6 功能，并积极将其融入到生产中。我对架构和软件设计模式充满热情，致力于打造优雅、可扩展的代码。"
    }
  }
]
